# 📍 DataFrame 데이터 확인
### ✅ 엑셀로 열기
: ```pd.read_excel('파일명.xlsx', index_col='column')```

In [1]:
import pandas as pd

df = pd.read_excel('score.xlsx', index_col='지원번호') # index 설정
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197   90   85  100  95  85      Python
2번    정대만  북산고  184   40   35   50  55  25        Java
3번    송태섭  북산고  168   80   75   70  80  75  Javascript
4번    서태웅  북산고  187   40   60   70  75  80         NaN
5번    강백호  북산고  188   15   20   10  35  10         NaN
6번    변덕규  능남고  202   80  100   95  85  80           C
7번    황태산  능남고  188   55   65   45  40  35      PYTHON
8번    윤대협  능남고  190  100   85   90  95  95          C#

### ✅ describe()
: 데이터에 대한 통계요약정보 제공
- count : 결측치를 제외한 데이터 갯수
- mean : 평균값
- std : 표준편차
- min : 최솟값
- 25% : 1사분위수
- 50% : 2사분위수(중앙값)
- 75% : 3사분위수
- max : 최댓값

In [2]:
df.describe()

                키          국어          영어          수학         과학         사회
count    8.000000    8.000000    8.000000    8.000000   8.000000   8.000000
mean   188.000000   62.500000   65.625000   66.250000  70.000000  60.625000
std      9.985704   29.519969   26.917533   30.325614  23.754699  32.120032
min    168.000000   15.000000   20.000000   10.000000  35.000000  10.000000
25%    186.250000   40.000000   53.750000   48.750000  51.250000  32.500000
50%    188.000000   67.500000   70.000000   70.000000  77.500000  77.500000
75%    191.750000   82.500000   85.000000   91.250000  87.500000  81.250000
max    202.000000  100.000000  100.000000  100.000000  95.000000  95.000000

: ```df.describe(include='object')```\
  categorical column (문자열 칼럼) 요약 통계 확인 가능

In [3]:
df.describe(include='object')
# unique(고유값) : ex. 북산고, 능남고 등)

         이름   학교    SW특기
count     8    8       6
unique    8    2       6
top     채치수  북산고  Python
freq      1    5       1

### ✅ info()
: 데이터의 각 특성에 대한 전반적인 정보 확인

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, 1번 to 8번
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      8 non-null      object
 1   학교      8 non-null      object
 2   키       8 non-null      int64
 3   국어      8 non-null      int64
 4   영어      8 non-null      int64
 5   수학      8 non-null      int64
 6   과학      8 non-null      int64
 7   사회      8 non-null      int64
 8   SW특기    6 non-null      object
dtypes: int64(6), object(3)
memory usage: 640.0+ bytes

### ✅ head(n)
: 상위 n개의 데이터프레임 확인

In [5]:
df.head() # default값은 5

       이름   학교    키  국어  영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197  90  85  100  95  85      Python
2번    정대만  북산고  184  40  35   50  55  25        Java
3번    송태섭  북산고  168  80  75   70  80  75  Javascript
4번    서태웅  북산고  187  40  60   70  75  80         NaN
5번    강백호  북산고  188  15  20   10  35  10         NaN

In [6]:
df.head(7)

       이름   학교    키  국어   영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197  90   85  100  95  85      Python
2번    정대만  북산고  184  40   35   50  55  25        Java
3번    송태섭  북산고  168  80   75   70  80  75  Javascript
4번    서태웅  북산고  187  40   60   70  75  80         NaN
5번    강백호  북산고  188  15   20   10  35  10         NaN
6번    변덕규  능남고  202  80  100   95  85  80           C
7번    황태산  능남고  188  55   65   45  40  35      PYTHON

### ✅ tail(n)
: 하위 n개의 데이터프레임 확인

In [7]:
df.tail() # default값은 5

       이름   학교    키   국어   영어  수학  과학  사회    SW특기
지원번호
4번    서태웅  북산고  187   40   60  70  75  80     NaN
5번    강백호  북산고  188   15   20  10  35  10     NaN
6번    변덕규  능남고  202   80  100  95  85  80       C
7번    황태산  능남고  188   55   65  45  40  35  PYTHON
8번    윤대협  능남고  190  100   85  90  95  95      C#

In [8]:
df.tail(3)

       이름   학교    키   국어   영어  수학  과학  사회    SW특기
지원번호
6번    변덕규  능남고  202   80  100  95  85  80       C
7번    황태산  능남고  188   55   65  45  40  35  PYTHON
8번    윤대협  능남고  190  100   85  90  95  95      C#

### ✅ values
: 데이터프레임값 추출\
  반환타입은 numpy array

In [9]:
df.values

array([['채치수', '북산고', 197, 90, 85, 100, 95, 85, 'Python'],
       ['정대만', '북산고', 184, 40, 35, 50, 55, 25, 'Java'],
       ['송태섭', '북산고', 168, 80, 75, 70, 80, 75, 'Javascript'],
       ['서태웅', '북산고', 187, 40, 60, 70, 75, 80, nan],
       ['강백호', '북산고', 188, 15, 20, 10, 35, 10, nan],
       ['변덕규', '능남고', 202, 80, 100, 95, 85, 80, 'C'],
       ['황태산', '능남고', 188, 55, 65, 45, 40, 35, 'PYTHON'],
       ['윤대협', '능남고', 190, 100, 85, 90, 95, 95, 'C#']], dtype=object)

### ✅ index
: 데이터프레임 index 추출

In [10]:
df.index

Index(['1번', '2번', '3번', '4번', '5번', '6번', '7번', '8번'], dtype='object', name='지원번호')

### ✅ columns
: 데이터프레임 columns 추출

In [11]:
df.columns

Index(['이름', '학교', '키', '국어', '영어', '수학', '과학', '사회', 'SW특기'], dtype='object')

### ✅ shape
: (행, 열) 튜플형태로 출력

In [12]:
df.shape # row, column

(8, 9)

### ✅ astype
: int32, float32, str(object), category 등으로 type 변경

In [13]:
df.dtypes

이름      object
학교      object
키        int64
국어       int64
영어       int64
수학       int64
과학       int64
사회       int64
SW특기    object
dtype: object

In [14]:
df['학교'] = df['학교'].astype('category')
df['학교'].head()

지원번호
1번    북산고
2번    북산고
3번    북산고
4번    북산고
5번    북산고
Name: 학교, dtype: category
Categories (2, object): ['능남고', '북산고']

### ✅ cat
: ```df.cat.codes```\
  카테고리를 숫자(index)로 변환

In [15]:
df['학교'].cat.codes

지원번호
1번    1
2번    1
3번    1
4번    1
5번    1
6번    0
7번    0
8번    0
dtype: int8

: ```df.cat.categories```\
  숫자로 변환된 카테고리 목록을 index순으로 확인 가능

In [16]:
[df['학교'].cat.categories]

[Index(['능남고', '북산고'], dtype='object')]

: ```df.cat.rename_categories([rename_list])```\
  카테고리의 이름을 재지정

In [17]:
df['학교'] = df['학교'].cat.rename_categories([g for g in df['학교'].cat.categories])
df['학교'].value_counts()

학교
북산고    5
능남고    3
Name: count, dtype: int64

# 📍 Series 데이터 확인
### ✅ describe()
: 데이터에 대한 통계요약정보 제공
- count : 결측치를 제외한 데이터 갯수
- mean : 평균값
- std : 표준편차
- min : 최솟값
- 25% : 1사분위수
- 50% : 2사분위수(중앙값)
- 75% : 3사분위수
- max : 최댓값

In [18]:
df['키'].describe()

count      8.000000
mean     188.000000
std        9.985704
min      168.000000
25%      186.250000
50%      188.000000
75%      191.750000
max      202.000000
Name: 키, dtype: float64